app/models/PasswordFindForm.php

UPDATE `user` SET `password_hash`='$2y$13$Y0LlSPMyu8Nr8KLc4rh.lOlt3SKu/7iYN2yOCl4AwgznlzINP0CHy', `password_reset_token`=NULL, `updated_at`=1528451001 WHERE `id`=1
---
    public function resetPassword()
    {
        $user = $this->_user;
        $user->setPassword($this->password);
        $user->removePasswordResetToken();
        Yii::$app->session->remove('find_password_token');
        return $user->save(false);