app/models/System.php

SELECT * FROM `system` WHERE `code`='captcha_length'
---
    public static function getValue($code = '') {
        $config = static::findOne(['code' => $code]);

SELECT * FROM `system` WHERE (`code`='captcha_open') AND (FIND_IN_SET('2', value))
---
    public static function existValue($code = '', $value = '') {
        return static::find()->where(['code' => $code])->andWhere('FIND_IN_SET(:value, value)')->addParams([':value' => $value])->one();

SELECT `id` FROM `system` WHERE `code`='sms'
SELECT * FROM `system` WHERE `parent_id`=4 ORDER BY `sort_order`
---
    public static function getChildren($code = '') {
        $parent = static::find()->where(['code' => $code])->select('id')->one();
        return static::find()->where(['parent_id' => $parent['id']])->orderBy('sort_order ASC')->all();

SELECT * FROM `system` WHERE `code`='sms_service'
UPDATE `system` SET `value`='LTAIYLj9nCnEujYw' WHERE `id`=403
---
    public static function setValue($code = '', $value = '') {
        $config = static::findOne(['code' => $code]);
        if ($value != $config['value']) {
            $config['value'] = $value;
            return $config->save();