app/models/User.php

SELECT * FROM `user` WHERE (`username`='admin') OR (`email`='admin') OR (`tel`='admin')
---
    public static function findByLoginname($name)
    {
        return static::find()->where(['or',['username' => $name],['email' => $name],['tel' => $name]])->one();

SELECT * FROM `user` WHERE `password_reset_token`='uRivvJLGNORNKK497s6Fd6XDt6WygJD__1528451090'
---
    public static function findByPasswordResetToken($token)
    {
        if (!static::isPasswordResetTokenValid($token)) {
            return null;
        }

        return static::findOne([
            'password_reset_token' => $token
        ]);